In [8]:
import pandas as pd
import db_functions as dbfnc
import config as cfg

# grab data from the db and input it to a df
# the query is HeadworkedTable joined with ShowTable joined with HeadNamesTable filtered on ShowName 'FLEX DAY'
sql_file=open(f'{cfg.sql_dir}\TMPHeadtbl_weekly_totals.sql')
query = sql_file.read()

with dbfnc.connection(cfg.my_driver, cfg.my_server, cfg.my_db) as conn:
    df = pd.read_sql(query, conn)

In [11]:
# Overtime conversions
df['OT_convert'] = df.OT.apply(lambda x:x*1.5)
df['DT_convert'] = df.Double.apply(lambda x:x*2)

# Combine all hours
sum_cols =['Reg', 'OT_convert', 'DT_convert']
df['all_hrs'] = df[sum_cols].sum(axis=1)

In [17]:
# sum and present the data
df.groupby(['FirstName','Note']).sum()

                                              Reg    OT  Double  OT_convert  \
FirstName Note
Arran     Engineered Air Salaried Billable  22.00  0.50    0.00       0.750
          Salaried Admin                    12.75  0.00    0.00       0.000
          Sound Maintenance                  4.50  0.00    0.00       0.000
Jack      Capital replacement               38.00  0.25    1.00       0.375
          Sound Maintenance                  2.00  0.00    0.00       0.000
Jaclyn    Capital replacement                1.50  0.00    0.00       0.000
          Jack Singer Salaried Billable      8.00  0.25    1.25       0.375
          Salaried Admin                    20.00  0.00    0.00       0.000
          Stage Maintenance                  9.50  0.00    0.00       0.000
          Stg Res Co                         1.00  0.00    0.00       0.000
Kris      Capital replacement               14.00  0.00    0.00       0.000
          LX Maintenance                     7.50  0.00    0.00       0.000
          LX Res Co                          4.00  0.00    0.00       0.000
          Salaried Admin                    14.50  0.00    0.00       0.000
Matt      Capital replacement               36.00  0.00    0.00       0.000
          Salaried Admin                     4.00  0.00    0.00       0.000
Rikki     Jack Singer Salaried Billable     15.00  0.50    0.00       0.750
          Salaried Admin                     8.25  0.00    0.00       0.000
          Stage Maintenance                 15.50  0.00    0.00       0.000
          Stg Res Co                         1.25  0.00    0.00       0.000
Terry     Salaried Admin                    40.00  0.00    0.00       0.000

                                            DT_convert  all_hrs
FirstName Note
Arran     Engineered Air Salaried Billable         0.0   22.750
          Salaried Admin                           0.0   12.750
          Sound Maintenance                        0.0    4.500
Jack      Capital replacement                      2.0   40.375
          Sound Maintenance                        0.0    2.000
Jaclyn    Capital replacement                      0.0    1.500
          Jack Singer Salaried Billable            2.5   10.875
          Salaried Admin                           0.0   20.000
          Stage Maintenance                        0.0    9.500
          Stg Res Co                               0.0    1.000
Kris      Capital replacement                      0.0   14.000
          LX Maintenance                           0.0    7.500
          LX Res Co                                0.0    4.000
          Salaried Admin                           0.0   14.500
Matt      Capital replacement                      0.0   36.000
          Salaried Admin                           0.0    4.000
Rikki     Jack Singer Salaried Billable            0.0   15.750
          Salaried Admin                           0.0    8.250
          Stage Maintenance                        0.0   15.500
          Stg Res Co                               0.0    1.250
Terry     Salaried Admin                           0.0   40.000

In [20]:
# grab data from the db and input it to a df
# the query is HeadworkedTable joined with ShowTable joined with HeadNamesTable filtered on ShowName 'FLEX DAY'
sql_file=open(f'{cfg.sql_dir}\TMPCasualtbl_weekly_totals.sql')
query = sql_file.read()

with dbfnc.connection(cfg.my_driver, cfg.my_server, cfg.my_db) as conn:
    df = pd.read_sql(query, conn)
    
# Overtime conversions
df['OT_convert'] = df.OT.apply(lambda x:x*1.5)
df['DT_convert'] = df.Double.apply(lambda x:x*2)

# Combine all hours
sum_cols =['Reg', 'OT_convert', 'DT_convert']
df['all_hrs'] = df[sum_cols].sum(axis=1)

# sum and present the data
df.groupby(['FirstName','Note']).sum()

                                Reg    OT  Double  OT_convert  DT_convert  \
FirstName Note
Graeme    Capital replacement   4.0  0.00     0.0       0.000         0.0
          Jack Casual Hours    20.0  2.00     0.0       3.000         0.0
Kimberly  EAT Casual Hours     22.0  0.50     0.0       0.750         0.0
          Jack Casual Hours     8.0  0.00     0.0       0.000         0.0
Kyle      Jack Casual Hours    10.0  0.00     0.0       0.000         0.0
Sam       Jack Casual Hours     7.0  0.00     0.0       0.000         0.0
Tobias    Jack Casual Hours     8.0  0.25     0.0       0.375         0.0

                               all_hrs
FirstName Note
Graeme    Capital replacement    4.000
          Jack Casual Hours     23.000
Kimberly  EAT Casual Hours      22.750
          Jack Casual Hours      8.000
Kyle      Jack Casual Hours     10.000
Sam       Jack Casual Hours      7.000
Tobias    Jack Casual Hours      8.375

In [73]:
# grab data from the db and input it to a df
# the query is HeadworkedTable joined with ShowTable joined with HeadNamesTable filtered on ShowName 'FLEX DAY'
sql_file=open(f'{cfg.sql_dir}\TMPCasualtbl_weekly_totals.sql')
query = sql_file.read()

with dbfnc.connection(cfg.my_driver, cfg.my_server, cfg.my_db) as conn:
    df = pd.read_sql(query, conn)
    
# Overtime conversions
df['OT_convert'] = df.OT.apply(lambda x:x*1.5)
df['DT_convert'] = df.Double.apply(lambda x:x*2)

# Combine all hours
sum_cols =['Reg', 'OT_convert', 'DT_convert']
df['all_hrs'] = df[sum_cols].sum(axis=1)

df = df.groupby(['FirstName','Note']).sum()

# sum and present the data
# for label, _df in df.groupby(['FirstName','Note']):
#     print(label)
#     print(_df)
#     print()

In [74]:
container = []

# sum and present the data
for label, _df in df.groupby(['FirstName']):
    _df.loc['Subtotal'] = _df[['Reg','OT', 'Double']].sum()
    container.append(_df)

c:\users\dmcdougall\appdata\local\programs\python\python38\lib\site-packages\pandas\core\indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [75]:
df_summary = pd.concat(container)

In [76]:
df_summary.loc['Grand Total'] = df[['Reg', 'OT', 'Double']].sum()

In [77]:
df_summary = df_summary.fillna('')

In [78]:
df_summary

,Reg,OT,Double,OT_convert,DT_convert,all_hrs
"(Graeme, Capital replacement)",4.0,0.00,0.0,0,0,4
"(Graeme, Jack Casual Hours)",20.0,2.00,0.0,3,0,23
Subtotal,24.0,2.00,0.0,,,
"(Kimberly, EAT Casual Hours)",22.0,0.50,0.0,0.75,0,22.75
"(Kimberly, Jack Casual Hours)",8.0,0.00,0.0,0,0,8
Subtotal,30.0,0.50,0.0,,,
"(Kyle, Jack Casual Hours)",10.0,0.00,0.0,0,0,10
Subtotal,10.0,0.00,0.0,,,
"(Sam, Jack Casual Hours)",7.0,0.00,0.0,0,0,7
Subtotal,7.0,0.00,0.0,,,
"(Tobias, Jack Casual Hours)",8.0,0.25,0.0,0.375,0,8.375
Subtotal,8.0,0.25,0.0,,,
Grand Total,79.0,2.75,0.0,,,